""" Пакет aiopath: Асинхронний аналог pathlib для роботи з файлами та каталогами
в асинхронному коді Python.

Якщо ви пишете асинхронний код Python і хочете скористатися перевагами pathlib, але не хочете
змішувати блокуюче та неблокуюче введення-виведення, ви можете звернутися до aiopath . API
aiopath прямо збігається з API pathlib, але всі необхідні методи асинхронні. Це означає, що ви 
можете використовувати aiopath для роботи з файлами та каталогами в асинхронному режимі, не блокуючи
основний потік виконання вашої програми.

Пакет aiopath надає асинхронні версії методів pathlib, таких як
exists(), is_file(), is_dir(), mkdir(), rmdir(), unlink() та багато інших. 
Це дозволяє вам виконувати файлові операції, не блокуючи ваш асинхронний код. Наприклад, ви можете
використовувати aiopath для перевірки існування файлу, створення каталогів, видалення файлів та
багато іншого, все це в асинхронному режимі.

Для використання aiopath вам потрібно встановити його за допомогою pip:
```
pip install aiopath
```
Наприклад, перевіримо, чи існує файл "hello.txt" у поточній папці: """

import asyncio
from aiopath import AsyncPath


async def main():
    """Перевіряємо,чи існує файл "hello.txt" у поточній папці, і чи є він файлом або директорією."""
    apath = AsyncPath("hello.txt")
    print(await apath.exists())
    print(await apath.is_file())
    print(await apath.is_dir())


if __name__ == '__main__':
    asyncio.run(main())
