""" Паралельне виконання CPU-bound завдань

Оскільки далеко не всі IO операції у всіх пакетах реалізують async/await синтаксис, 
то часто трапляється, що потрібно виконати в асинхронному коді блокуючий IO виклик з 
пакета, де немає async/await аналога.

Для цього можна скористатися вже відомим вам пакетом concurrent.futures та методом 
run_in_executor об'єкта loop (це і є Event loop).

Розглянемо наступний приклад, де у нас є синхронна функція blocks, яка виконує важкі 
обчислення. Щоб здійснити блокуючий виклик в Event loop, ми розміщуємо його в Executor 
і тоді виклик виконується в окремому потоці або процесі. У разі, коли основна частина 
коду – асинхронна (у нашому випадку це функція monitoring) і лише окремий виклик блокує 
увесь Event loop ( функція blocks), такий спосіб перетворити блокуючу функцію на асинхронну 
цілком виправданий.

Сам процес перетворення синхронного коду в асинхронний досить простий. Ми обгортаємо функцію 
blocks функцією run_blocking_tasks. Всередині неї беремо окремий loop = asyncio.get_event_loop() 
та через виклик run_in_executor отримуємо асинхронний результат функції blocks. В якості 
Executor у нас виступає concurrent.futures.ThreadPoolExecutor """

import asyncio
import concurrent.futures
from time import time


def blocks(n):
    """ Ця функція виконує важкі обчислення, які блокують Event loop. Вона просто рахує до n, 
    що є CPU-bound завданням. Час виконання залежить від значення n."""
    counter = n
    start = time()
    while counter > 0:
        counter -= 1
    return time() - start


async def monitoring():
    """ Ця співпрограма імітує моніторинг, який виконується паралельно з блокуючими 
    завданнями. Вона просто виводить повідомлення кожні 2 секунди, щоб показати, що 
    Event loop не заблокований."""
    while True:
        await asyncio.sleep(2)
        print(f'Monitoring {time()}')


async def run_blocking_tasks(executor, n):
    """ Ця співпрограма обгортає блокуючу функцію blocks, щоб вона могла виконуватися 
    в окремому потоці або процесі. Вона отримує Executor та параметр n, який передається 
    в blocks. Використовуючи get_event_loop та run_in_executor, вона виконує блокуючий виклик
    в Event loop і повертає результат після його завершення."""
    # Отримуємо поточний Event loop, який буде використовуватися для виконання блокуючого виклику.
    loop = asyncio.get_event_loop()
    print('waiting for executor tasks')
    # Виконуємо блокуючий виклик в Executor, передаючи функцію blocks та її аргумент n.
    # Результат буде отримано асинхронно після завершення виконання.
    task_result = await loop.run_in_executor(executor, blocks, n)
    return task_result


async def main():
    """ У цій співпрограмі ми створюємо завдання для моніторингу, яке буде виконуватися 
    паралельно з блокуючими завданнями. Потім ми створюємо ThreadPoolExecutor з трьома 
    робочими потоками і запускаємо кілька блокуючих завдань з різними значеннями n. 
    Використовуючи asyncio.gather, ми чекаємо на завершення всіх блокуючих завдань і отримуємо
    їх результати."""
    # Створюємо завдання для моніторингу, яке буде виконуватися паралельно з блокуючими завданнями.
    asyncio.create_task(monitoring())
    # Створюємо ThreadPoolExecutor з трьома робочими потоками, який буде використовуватися для
    # виконання блокуючих завдань.
    with concurrent.futures.ThreadPoolExecutor(max_workers=3) as executor:
        # Створюємо список завдань для виконання блокуючих функцій blocks з різними значеннями n.
        # Кожне завдання буде виконуватися в окремому потоці, що дозволяє нам виконувати їх 
        # паралельно, не блокуючи Event loop.
        futures = [run_blocking_tasks(executor, n) for n in [50_000_000, 60_000_000, 70_000_000]]
        # asyncio.gather дозволяє нам чекати на завершення всіх блокуючих завдань, які виконуються
        #в Executor, і отримувати їх результати у вигляді списку. Це дозволяє нам ефективно керувати
        # кількома блокуючими завданнями, які виконуються паралельно, не блокуючи Event loop.
        results = await asyncio.gather(*futures)
        return results


if __name__ == '__main__':
    # Виклик з синхронного коду, який запускає асинхронну функцію main та отримує її результат.
    # Після отримання результату ми виводимо його в консоль. В результаті ви побачите, що моніторинг
    # виконується паралельно з блокуючими завданнями, і після їх завершення будуть виведені часи
    # виконання кожного з них.
    result = asyncio.run(main())
    for r in result:
        print(r)

# В результаті в консолі ви побачите:
# waiting for executor tasks
# waiting for executor tasks
# waiting for executor tasks
# Monitoring 1667170130.4642367
# Monitoring 1667170132.527182
# 4.648142337799072
# 5.0788047313690186
# 5.447803974151611
