""" Порівняння синхронного та асинхронного підходів до роботи з базою даних.
Ми отримуємо той самий результат, але втричі швидший. Фактично ми запустили три функції get_user_async 
на паралельне виконання і цей процес зайняв близько 0.5 секунд. Допоміжна функція asyncio.gather потрібна,
щоб покласти в чергу кілька співпрограм та дозволити Event loop виконувати їх у будь-якому порядку.
Крім того, asyncio.gather повертає результат виконання coroutine у тому порядку, в якому вони були викликані."""

import asyncio
from time import sleep, time

fake_users = [
    {'id': 1, 'name': 'April Murphy', 'company': 'Bailey Inc', 'email': 'shawnlittle@example.org'},
    {'id': 2, 'name': 'Emily Alexander', 'company': 'Martinez-Smith', 'email': 'turnerandrew@example.org'},
    {'id': 3, 'name': 'Patrick Jones', 'company': 'Young, Pruitt and Miller', 'email': 'alancoleman@example.net'}
]


def get_user_sync(uid: int) -> dict:
    """ Синхронна функція, яка імітує затримку при отриманні даних з бази даних. 
    Вона приймає ідентифікатор користувача, виконує затримку в 0.5 секунди і повертає 
    словник з даними користувача, який відповідає цьому ідентифікатору."""
    # У синхронній версії ми використовуємо time.sleep(0.5), що блокує виконання всієї програми
    # на 0.5 секунди. Це означає, що під час цієї затримки ніякі інші операції не можуть
    # виконуватися, що може призвести до неефективного використання часу, особливо якщо ми маємо
    # справу з великою кількістю запитів або іншими операціями вводу-виводу.
    sleep(0.5)
    # Після затримки ми виконуємо пошук користувача в списку fake_users, використовуючи filter і
    # lambda-функцію для знаходження словника, де "id" відповідає переданому uid. Оскільки ми
    # очікуємо знайти лише одного користувача з таким id, ми розпаковуємо результат у змінну user.
    # Цей підхід є простим і зрозумілим, але він не дозволяє ефективно обробляти кілька запитів
    # одночасно, оскільки кожен виклик get_user_sync буде блокувати виконання інших операцій до
    # завершення затримки. У контексті роботи з базою даних це може призвести до значних затримок,
    # якщо багато запитів будуть оброблятися послідовно.
    user, = list(filter(lambda user: user["id"] == uid, fake_users))
    return user

async def get_user_async(uid: int) -> dict:
    """ Асинхронна функція, яка імітує затримку при отриманні даних з бази даних. 
    Вона приймає ідентифікатор користувача, виконує асинхронну затримку в 0.5 секунди 
    і повертає словник з даними користувача, який відповідає цьому ідентифікатору."""
    # Замість time.sleep(0.5) використовуємо await asyncio.sleep(0.5), щоб не блокувати
    # виконання інших корутин, які можуть працювати паралельно. Це дозволяє ефективно
    # використовувати час очікування, не блокуючи основний потік виконання.
    await asyncio.sleep(0.5)
    # Після затримки ми виконуємо той же пошук користувача, що і в синхронній версії, але
    # тепер це відбувається в асинхронному контексті, що дозволяє іншим корутинам виконуватися
    # під час очікування результату. Це особливо корисно, коли ми маємо справу з великою кількістю
    # запитів до бази даних або іншими операціями вводу-виводу, які можуть займати значний час.
    user, = list(filter(lambda user: user["id"] == uid, fake_users))
    return user


async def main():
    """ Головна асинхронна функція, яка викликає get_user_async для трьох різних 
    ідентифікаторів"""
    # У цій функції ми створюємо порожній список r, а потім в циклі for проходимо по ідентифікаторах
    # від 1 до 3. Для кожного ідентифікатора ми викликаємо get_user_async(i) і додаємо отриману корутину
    # до списку r. Після того, як ми зібрали всі корутини в списку r, ми використовуємо
    # await asyncio.gather(*r), щоб виконати всі корутини одночасно і отримати їх результати у вигляді списку.
    # Це дозволяє нам ефективно обробляти кілька запитів до бази даних паралельно, не блокуючи виконання інших
    # операцій.
    r = []
    for i in range(1, 4):
        r.append(get_user_async(i))
    return await asyncio.gather(*r)

if __name__ == '__main__':
# Синхронний підхід
    start = time()
    for i in range(1, 4):
        print(get_user_sync(i))
    print(f"Час виконання синхронного підходу: {time() - start}")
    print("Чекаємо 5 секунд перед асинхронним підходом...")
    sleep(5)  # Додаємо паузу, щоб відокремити виведення синхронного та асинхронного підходів.

# Асинхронний підхід
    start = time()
    result = asyncio.run(main())
    for r in result:
        print(r)
    print(f"Час виконання асинхронного підходу: {time() - start}")

# Виведення буде приблизно таким:
# {'id': 1, 'name': 'April Murphy', 'company': 'Bailey Inc', 'email': 'shawnlittle@example.org'}
# {'id': 2, 'name': 'Emily Alexander', 'company': 'Martinez-Smith', 'email': 'turnerandrew@example.org'}
# {'id': 3, 'name': 'Patrick Jones', 'company': 'Young, Pruitt and Miller', 'email': 'alancoleman@example.net'}
# Час виконання синхронного підходу: 1.5031461715698242
# Чекаємо 5 секунд перед асинхронним підходом...
# {'id': 1, 'name': 'April Murphy', 'company': 'Bailey Inc', 'email': 'shawnlittle@example.org'}
# {'id': 2, 'name': 'Emily Alexander', 'company': 'Martinez-Smith', 'email': 'turnerandrew@example.org'}
# {'id': 3, 'name': 'Patrick Jones', 'company': 'Young, Pruitt and Miller', 'email': 'alancoleman@example.net'}
# Час виконання асинхронного підходу: 0.5052382946014404
