""" Паралельне виконання завдань

Зазвичай працювати з низькорівневими примітивами asyncio не потрібно і не рекомендується.
Але якщо виникає необхідність, то можна відправити завдання до поточного Event loop за
допомогою функції create_task, яка повертає об'єкт Task.

Завдання Task — це один із основних способів взаємодії з циклом подій. Вони є обгортками
над співпрограмами та відстежують момент їх завершення. Оскільки завдання є похідним класом
від Future, то наслідують частину його функціональності, а саме:

    - інші співпрограми можуть очікувати на завершення завдань
    - кожне завдання має результат, який може бути отриманий після його завершення

Результуюче завдання буде виконуватися як частина паралельних операцій, які управляються 
Event loop, доки виконується цикл та співпрограма не поверне управління.

Зверніть увагу, що доки не було викликано await task у наступному прикладі, завдання не 
виконувалося. """

import asyncio
import random


async def random_value():
    """ Ця співпрограма імітує довготривалу операцію, яка повертає випадкове число після 
    затримки."""
    print("start task")
    await asyncio.sleep(1)
    print("task finished")
    return random.random()


async def main():
    """ У цій співпрограмі ми створюємо завдання для виконання random_value, але не чекаємо 
    його завершення відразу. Це дозволяє нам виконувати інші операції, поки завдання 
    виконується. Після того, як ми викликаємо await task, ми чекаємо на завершення завдання
    і отримуємо його результат. """
    task = asyncio.create_task(random_value())
    print("task scheduled")
    await task
    print(f"result: {task.result()}")


if __name__ == '__main__':
    asyncio.run(main())


# В результаті в консолі ви побачите:
# task scheduled
# start task
# task finished
# result: 0.4314553905867432
